#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key1: Refreshing state... [id=f3ab58e7637f701928c27c54f7f2d4d2f691bf0b]
azurerm_resource_group.rg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05MzE4MjkwMS1jZGU2LTRmMGQtOGQ1Mi00YTg2ZjZlNzg5MzA7b2JqZWN0SWQ9ZGYzNTY1ZGMtNDEzZC00NmY1LTg2OTUtOTAyNjFlYjA0ZmUyO3N1YnNjcmlwdGlvbklkPTNmZTM0YzdkLTg0ODYtNGZmZi1hZDEwLWEzYWZjMGNmMDliNTt0ZW5hbnRJZD1mN2YxNmFjMS1jZWNiLTQzODMtYjAxMS04Y2ViZmI5OWUwYmE=]
random_id.random_id: Refreshing state... [id=jT91hC-rLBE]
azurerm_virtual_network.vnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet]
azurerm_public_ip.nic1_ip: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/publicIPAddresses/lt-tf-demo-public-ip]
azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_network_security_group.nsg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_storage_account.storage_boot_diagnostics: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Storage/storageAccounts/diag8d3f75842fab2c11]
azurerm_subnet.subnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet/subnets/lt-tf-demo-subnet]
azurerm_network_interface.nic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1]
azurerm_network_interface_security_group_association.nic1_nsg1_connect: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_key_vault_access_policy.kv_policy: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv/objectId/df3565dc-413d-46f5-8695-90261eb04fe2]
data.azurerm_key_vault.kv1: Reading...
data.azurerm_key_vault.kv1: Read complete after 1s [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_key_vault_secret.privatekey: Refreshing state... [id=https://lt-tf-demo-kv.vault.azure.net/secrets/lt-tf-demo-vm1-privatekey/75b8097a7c4d48f1b20fdb33a792441b]
azurerm_linux_virtual_machine.vm1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_security_group.asg1 will be created
  + resource "azurerm_application_security_group" "asg1" {
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "tf-demo-asg-servers"
      + resource_group_name = "lt-tf-demo-rg"
    }

  # azurerm_application_security_group.asg2 will be created
  + resource "azurerm_application_security_group" "asg2" {
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "tf-demo-asg-databases"
      + resource_group_name = "lt-tf-demo-rg"
    }

  # azurerm_key_vault_secret.privatekey2 will be created
  + resource "azurerm_key_vault_secret" "privatekey2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv"
      + name                    = "lt-tf-demo-vm2-privatekey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_virtual_machine.vm1 will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm1" {
        id                              = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1"
        name                            = "lt-tf-demo-vm1"
      ~ size                            = "Standard_B1s" -> "Standard_B1S"
        tags                            = {}
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.vm2 will be created
  + resource "azurerm_linux_virtual_machine" "vm2" {
      + admin_username                  = "azureuser"
      + allow_extension_operations      = true
      + computer_name                   = "lt-tf-demo-vm2"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "norwayeast"
      + max_bid_price                   = -1
      + name                            = "lt-tf-demo-vm2"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "lt-tf-demo-rg"
      + size                            = "Standard_B1S"
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "azureuser"
        }

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "lt-tf-demo-vm2-disk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_network_interface.nic1 will be updated in-place
  ~ resource "azurerm_network_interface" "nic1" {
        id                            = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1"
        name                          = "lt-tf-demo-nic1"
        tags                          = {}
        # (11 unchanged attributes hidden)

      ~ ip_configuration {
          ~ name                          = "lt-tf-demo-nic1-conf" -> "lt-tf-demo-nic2-conf"
            # (6 unchanged attributes hidden)
        }
    }

  # azurerm_network_interface.nic2 will be created
  + resource "azurerm_network_interface" "nic2" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "norwayeast"
      + mac_address                   = (known after apply)
      + name                          = "lt-tf-demo-nic2"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "lt-tf-demo-rg"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "lt-tf-demo-nic2-conf"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface_application_security_group_association.asgnic1 will be created
  + resource "azurerm_network_interface_application_security_group_association" "asgnic1" {
      + application_security_group_id = (known after apply)
      + id                            = (known after apply)
      + network_interface_id          = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1"
    }

  # azurerm_network_interface_application_security_group_association.asgnic2 will be created
  + resource "azurerm_network_interface_application_security_group_association" "asgnic2" {
      + application_security_group_id = (known after apply)
      + id                            = (known after apply)
      + network_interface_id          = (known after apply)
    }

  # azurerm_network_interface_security_group_association.nic2_nsg1_connect will be created
  + resource "azurerm_network_interface_security_group_association" "nic2_nsg1_connect" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg"
    }

  # azurerm_network_security_group.nsg1 will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg1" {
        id                  = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg"
        name                = "lt-tf-demo-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 1001
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
            # (2 unchanged elements hidden)
        ]
        tags                = {}
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage_boot_diagnostics2 will be created
  + resource "azurerm_storage_account" "storage_boot_diagnostics2" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "norwayeast"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "lt-tf-demo-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_subnet.subnet2 will be created
  + resource "azurerm_subnet" "subnet2" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "lt-tf-demo-subnet2"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "lt-tf-demo-rg"
      + virtual_network_name                           = "lt-tf-demo-vnet"
    }

  # random_id.random_id2 will be created
  + resource "random_id" "random_id2" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "lt-tf-demo-rg"
        }
    }

  # tls_private_key.ssh_key2 will be created
  + resource "tls_private_key" "ssh_key2" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 12 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larstthorsen, Action: `pull_request`*